TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/examples/c28x/sdfm/sdfm_ex6_FIFO_freeze_claread.c
//###########################################################################
//
// FILE:   sdfm_ex6_FIFO_freeze_claread.c
//
// TITLE:  SDFM Filter sync with FIFO Freeze CLA Example.
//
//! \addtogroup driver_example_list
//! <h1> SDFM Filter Sync CLA</h1>
//!
//! In this example, SDFM FIFO will not be filled until a SDSYNC event.
//! On a SDSYNC event, SDFM data filter output will start filling FIFO
//! and stop filling after programmable number 'N' of FIFO is filled.
//!
//! SDy-C1 (Filter1 channel clock) is internally configured to connected
//! SDy-C2 / SDy-C3 / SDy-C4
//! SDFM configuration is shown below:
//!  - SDFM1 used in this example.For using SDFM2, few modifications
//!    would be needed in the example.
//!  - MODE0 Input control mode selected
//!  - Comparator settings
//!       -    Sinc3 filter selected
//!       -    OSR = 32
//!       -    hlt = 0x7FFF (Higher threshold setting)
//!       -    llt  = 0x0000(Lower threshold setting)
//!  -  Data filter settings
//!      - All the 4 filter modules enabled
//!      - Sinc3 filter selected
//!      - OSR = 256
//!      - All the 4 filters are synchronized by using MFE
//!       (Master Filter enable bit)
//!      - Filter output represented in 16 bit format
//!      - In order to convert 25 bit Data filter
//!        into 16 bit format user needs to right shift by 10 bits for
//!        Sinc3 filter with OSR = 256
//!  - Interrupt module settings for SDFM filter
//!       -    All the 4 higher threshold comparator interrupts disabled
//!       -    All the 4 lower threshold comparator interrupts disabled
//!       -    All the 4 modulator failure interrupts disabled
//!       -    All the 4 filter will generate interrupt when a new filter data
//!         is available
//!
//! \b External \b Connections \n
//!   - SDFM_PIN_MUX_OPTION1 Connect Sigma-Delta streams to
//!     (SDx-D1, SDx-C1 to SDx-D4,SDx-C4) on GPIO16-GPIO31
//!   - SDFM_PIN_MUX_OPTION2 Connect Sigma-Delta streams to
//!     (SDx-D1, SDx-C1 to SDx-D4,SDx-C4) on GPIO48-GPIO63
//!   - SDFM_PIN_MUX_OPTION3 Connect Sigma-Delta streams to
//!     (SDx-D1, SDx-C1 to SDx-D4,SDx-C4) on GPIO122-GPIO137
//!
//! \b Watch \b Variables \n
//! -  \b filter1Result - Output of filter 1
//! -  \b filter2Result - Output of filter 2
//! -  \b filter3Result - Output of filter 3
//! -  \b filter4Result - Output of filter 4
//!
//
//#############################################################################
//
//
// 
// C2000Ware v6.00.01.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################
//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include <stdio.h>
#include "sdfm_claread.h"

//
// Defines
//
#define SDFM_PIN_MUX_OPTION1      1
#define SDFM_PIN_MUX_OPTION2      2
#define SDFM_PIN_MUX_OPTION3      3
#define WAITSTEP                  asm(" RPT #255 || NOP")

#define OSCLK_INPUT_CLOCK_MHz     25
#define EPWM_TIMER_TBPRD          65535

//
// Globals
//
uint32_t sdfmInstance;

//
// Function Prototypes
//
void configurePWMPins(void);
void configureSDFMPins(uint16_t);
void setPinConfig1(void);
void setPinConfig2(void);
void setPinConfig3(void);
void initCLAMemoryMap(void);
void initCPU1CLA(void);


void generateSD_clock_MHz(float,uint16_t);
void initEPWM(uint32_t,EPWM_CounterCompareModule);

//
// Main
//
int main(void)
{
    uint16_t  pinMuxOption;
    uint16_t  hlt, llt;

    //
    // Initialize device clock and peripherals
    //
    Device_init();

    //
    // Setup GPIO by disabling pin locks and enabling pullups
    //
    Device_initGPIO();

    //
    // Initialize PIE and clear PIE registers. Disables CPU interrupts.
    //
    Interrupt_initModule();

    //
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // Service Routines (ISR).
    //
    Interrupt_initVectorTable();

    //
    // Configure SDFM type to 0 and see if data ack generated SDINT.
    //
    SysCtl_configureType(SYSCTL_SDFMTYPE, 0, 1);

#ifdef CPU1
    pinMuxOption = SDFM_PIN_MUX_OPTION1;

    //
    // Configure GPIO pins as SDFM pins
    //
    configureSDFMPins(pinMuxOption);

    // This PWM signal can be used to generate clock for SD-modulator
    // Configure GPIO0 pins as PWM pin
    //
    configurePWMPins();

#endif

    float SD_Modulator_freq_in_MHz = 20;

    //
    // PWM1A is configured to generated SD-modulator input clock
    //
    generateSD_clock_MHz(SD_Modulator_freq_in_MHz, OSCLK_INPUT_CLOCK_MHz);

    //
    // PWM11A is configured to generated SDSYNC signal to SDFM
    //
    initEPWM(EPWM11_BASE, EPWM_COUNTER_COMPARE_A);

    //
    // Configure the CLA memory spaces
    //
    initCLAMemoryMap();

    //
    // Configure the CLA task vectors & end-of task interrupts
    //
    initCPU1CLA();

    //
    // Force task 8
    //
    CLA_forceTasks(CLA1_BASE,CLA_TASKFLAG_8);
    WAITSTEP;

    //
    // Trigger Source for TASK1 of CLA1 = SDFM1
    //
    CLA_setTriggerSource(CLA_TASK_1, CLA_TRIGGER_SDFM1DRINT1);

    //
    // Trigger Source for TASK2 of CLA1 = SDFM2
    //
    CLA_setTriggerSource(CLA_TASK_2, CLA_TRIGGER_SDFM2DRINT1);

    //
    // Configure SDFM1
    //
    sdfmInstance = SDFM1_BASE;

    //
    // Use FILTER (SD-C1) for FILTER2, FILTER3, FILTER4
    //
    SDFM_selectClockSource(sdfmInstance, SDFM_FILTER_1, SDFM_CLK_SOURCE_CHANNEL_CLK);
    SDFM_selectClockSource(sdfmInstance, SDFM_FILTER_2, SDFM_CLK_SOURCE_SD1_CLK);
    SDFM_selectClockSource(sdfmInstance, SDFM_FILTER_3, SDFM_CLK_SOURCE_SD1_CLK);
    SDFM_selectClockSource(sdfmInstance, SDFM_FILTER_4, SDFM_CLK_SOURCE_SD1_CLK);

    //
    // Use Synchronizer on both SD-Cx and SD-Dx channels
    //
    SDFM_enableSynchronizer(sdfmInstance, SDFM_FILTER_1, SDFM_CLOCK_SYNCHRONIZER |
                                                         SDFM_DATA_SYNCHRONIZER);
    SDFM_enableSynchronizer(sdfmInstance, SDFM_FILTER_2, SDFM_CLOCK_SYNCHRONIZER |
                                                         SDFM_DATA_SYNCHRONIZER);
    SDFM_enableSynchronizer(sdfmInstance, SDFM_FILTER_3, SDFM_CLOCK_SYNCHRONIZER |
                                                         SDFM_DATA_SYNCHRONIZER);
    SDFM_enableSynchronizer(sdfmInstance, SDFM_FILTER_4, SDFM_CLOCK_SYNCHRONIZER |
                                                         SDFM_DATA_SYNCHRONIZER);

    //
    // Input Control Module
    //
    // Configure Input Control Mode: Modulator Clock rate = Modulator data rate
    //
    SDFM_setupModulatorClock(sdfmInstance, SDFM_FILTER_1,
                             SDFM_MODULATOR_CLK_EQUAL_DATA_RATE);

    SDFM_setupModulatorClock(sdfmInstance, SDFM_FILTER_2,
                             SDFM_MODULATOR_CLK_EQUAL_DATA_RATE);

    SDFM_setupModulatorClock(sdfmInstance, SDFM_FILTER_3,
                             SDFM_MODULATOR_CLK_EQUAL_DATA_RATE);

    SDFM_setupModulatorClock(sdfmInstance, SDFM_FILTER_4,
                             SDFM_MODULATOR_CLK_EQUAL_DATA_RATE);

    //
    // Comparator Module
    //
    hlt = 0x7FFF;    //Over value threshold settings
    llt = 0x0000;    //Under value threshold settings

    //
    // Configure Comparator module's comparator filter type and comparator's OSR
    // value, higher threshold, lower threshold
    //
    SDFM_configComparator(sdfmInstance,
        (SDFM_FILTER_1 | SDFM_FILTER_SINC_3 | SDFM_SET_OSR(32)),
        (SDFM_THRESHOLD(hlt,llt)), 0);
    SDFM_configComparator(sdfmInstance,
        (SDFM_FILTER_2 | SDFM_FILTER_SINC_3 | SDFM_SET_OSR(32)),
        (SDFM_THRESHOLD(hlt,llt)), 0);
    SDFM_configComparator(sdfmInstance,
        (SDFM_FILTER_3 | SDFM_FILTER_SINC_3 | SDFM_SET_OSR(32)),
        (SDFM_THRESHOLD(hlt,llt)), 0);
    SDFM_configComparator(sdfmInstance,
        (SDFM_FILTER_4 | SDFM_FILTER_SINC_3 | SDFM_SET_OSR(32)),
        (SDFM_THRESHOLD(hlt,llt)), 0);

    //
    // Data filter Module
    //
    // Configure Data filter modules filter type, OSR value and
    // enable / disable data filter
    //
    SDFM_configDataFilter(sdfmInstance, (SDFM_FILTER_1 | SDFM_FILTER_SINC_3 |
           SDFM_SET_OSR(256)), (SDFM_DATA_FORMAT_16_BIT | SDFM_FILTER_ENABLE |
           SDFM_SHIFT_VALUE(0x000A)));

    SDFM_configDataFilter(sdfmInstance, (SDFM_FILTER_2 | SDFM_FILTER_SINC_3 |
           SDFM_SET_OSR(256)), (SDFM_DATA_FORMAT_16_BIT | SDFM_FILTER_ENABLE |
           SDFM_SHIFT_VALUE(0x000A)));

    SDFM_configDataFilter(sdfmInstance, (SDFM_FILTER_3 | SDFM_FILTER_SINC_3 |
           SDFM_SET_OSR(256)), (SDFM_DATA_FORMAT_16_BIT | SDFM_FILTER_ENABLE |
           SDFM_SHIFT_VALUE(0x000A)));

    SDFM_configDataFilter(sdfmInstance, (SDFM_FILTER_4 | SDFM_FILTER_SINC_3 |
           SDFM_SET_OSR(256)), (SDFM_DATA_FORMAT_16_BIT | SDFM_FILTER_ENABLE |
           SDFM_SHIFT_VALUE(0x000A)));


    //
    // Enable SDFM FIFO for all filters
    //
    SDFM_enableFIFOBuffer(sdfmInstance, SDFM_FILTER_1);
    SDFM_enableFIFOBuffer(sdfmInstance, SDFM_FILTER_2);
    SDFM_enableFIFOBuffer(sdfmInstance, SDFM_FILTER_3);
    SDFM_enableFIFOBuffer(sdfmInstance, SDFM_FILTER_4);

    //
    // Set SDFFIL = 5 for all filters
    //
    SDFM_setFIFOInterruptLevel(sdfmInstance, SDFM_FILTER_1, 5);
    SDFM_setFIFOInterruptLevel(sdfmInstance, SDFM_FILTER_2, 5);
    SDFM_setFIFOInterruptLevel(sdfmInstance, SDFM_FILTER_3, 5);
    SDFM_setFIFOInterruptLevel(sdfmInstance, SDFM_FILTER_4, 5);

    //
    // Enable FIFO data ready interrupt for SDFM
    //
    SDFM_setDataReadyInterruptSource(sdfmInstance, SDFM_FILTER_1, SDFM_DATA_READY_SOURCE_FIFO);
    SDFM_setDataReadyInterruptSource(sdfmInstance, SDFM_FILTER_2, SDFM_DATA_READY_SOURCE_FIFO);
    SDFM_setDataReadyInterruptSource(sdfmInstance, SDFM_FILTER_3, SDFM_DATA_READY_SOURCE_FIFO);
    SDFM_setDataReadyInterruptSource(sdfmInstance, SDFM_FILTER_4, SDFM_DATA_READY_SOURCE_FIFO);


    //
    // Enable SDFM Wait for Sync feature
    //
    SDFM_enableWaitForSync(sdfmInstance, SDFM_FILTER_1);
    SDFM_enableWaitForSync(sdfmInstance, SDFM_FILTER_2);
    SDFM_enableWaitForSync(sdfmInstance, SDFM_FILTER_3);
    SDFM_enableWaitForSync(sdfmInstance, SDFM_FILTER_4);

    //
    // Enable Master filter bit: Unless this bit is set none of the filter
    // modules can be enabled. All the filter modules are synchronized when
    // master filter bit is enabled after individual filter modules are enabled.
    //
    SDFM_enableMainFilter(sdfmInstance);

    //
    // PWM11.CMPC, PWM11.CMPD, PWM12.CMPC and PWM12.CMPD signals can synchronize
    // the filters. This option is not being used in this example.
    //
    SDFM_enableExternalReset(sdfmInstance, SDFM_FILTER_1);
    SDFM_enableExternalReset(sdfmInstance, SDFM_FILTER_2);
    SDFM_enableExternalReset(sdfmInstance, SDFM_FILTER_3);
    SDFM_enableExternalReset(sdfmInstance, SDFM_FILTER_4);

    //
    // Use PWM11.SOCA to provide SDSYNC pulse to SDFM
    //
    SDFM_setPWMSyncSource(sdfmInstance, SDFM_FILTER_1, SDFM_SYNC_PWM11_SOCA);
    SDFM_setPWMSyncSource(sdfmInstance, SDFM_FILTER_2, SDFM_SYNC_PWM11_SOCA);
    SDFM_setPWMSyncSource(sdfmInstance, SDFM_FILTER_3, SDFM_SYNC_PWM11_SOCA);
    SDFM_setPWMSyncSource(sdfmInstance, SDFM_FILTER_4, SDFM_SYNC_PWM11_SOCA);


    //
    // Enable interrupts
    //
    // Following SDFM interrupts can be enabled / disabled using this function.
    //  Enable / disable comparator high threshold
    //  Enable / disable comparator low threshold
    //  Enable / disable modulator clock failure
    //  Enable / disable filter acknowledge
    //
    SDFM_enableInterrupt(sdfmInstance, SDFM_FILTER_1,
            (SDFM_MODULATOR_FAILURE_INTERRUPT   |
             SDFM_FIFO_INTERRUPT));

    SDFM_enableInterrupt(sdfmInstance, SDFM_FILTER_2,
            (SDFM_MODULATOR_FAILURE_INTERRUPT   |
             SDFM_FIFO_INTERRUPT));

    SDFM_enableInterrupt(sdfmInstance, SDFM_FILTER_3,
            (SDFM_MODULATOR_FAILURE_INTERRUPT   |
             SDFM_FIFO_INTERRUPT));

